Revit 2024 API
BuiltInFailures.FaceSplitterFailures.EndsNotOnEdgeError Property
 Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EndsNotOnEdgeError { get; }
Visual Basic
Public Shared ReadOnly Property EndsNotOnEdgeError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EndsNotOnEdgeError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace